exCommentary2.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>exCommentary2</title>
<!-- 2014-12-21 Sun 14:36 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Carlo Nucera" />
</head>
<body>
<div id="content">
<h1 class="title">exCommentary2</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Second installment</a>
<ul>
<li><a href="#sec-1-1">1.1. Types</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Second installment</h2>
<div class="outline-text-2" id="text-1">
<p>
Here is the second installment in the series which explores the
functioning of the music-suite library. Here is the code we wrote
last time:
</p>

<div class="org-src-container">

<pre class="src src-haskell">import Music.Prelude

permittedMelodicIntervals :: [Interval]
permittedMelodicIntervals = [ perfect unison, major second, minor second
                            , major third,    minor third,  perfect fourth
                            , perfect fifth,  major sixth,  minor sixth
                            , perfect octave]

type CounterpointVoice = Aligned (Voice Pitch)

cantus :: CounterpointVoice 
cantus = [d, a, g, f, e, d, f, e, d] ^. voice . to (aligned 0 0)

render :: CounterpointVoice -&gt; Score StandardNote
render = fmap (fromPitch' . pure) . renderAlignedVoice 

action :: IO ()
action = writeLilypond "cantus.ly" $ render cantus
</pre>
</div>

<p>
We forget for a minute the annotation problem (the action function
freezes on execution), as there is a bug which prevents the
compilation of the examples. So, let's focus on how we could write two
counterpoints and check their mutual relationship, in a generic way,
ie. a way that will work when we will begin to write exercices in
three parts.
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Types</h3>
<div class="outline-text-3" id="text-1-1">
<p>
So, we know that we should use the counterpointVoice to model a
voice. Let's model a two parts first species counterpoint,
instead. For musical theoretical reasons, we want to distinguish
the position of the cantus with respect to that of the counterpoint
itself.
</p>

<p>
The first design I have in my mind is to create Two Parts First
Species Counterpoint
</p>

<div class="org-src-container">

<pre class="src src-haskell">-- Two parts first species counterpoint
data TPFSC = TPFSC { topVoice :: CounterpointVoice
                   , bottomVoice :: CounterpointVoice
                   } deriving (Eq, Show)
</pre>
</div>

<p>
Here arises a problem. The Eq deriving is incorrect, as the program
doesn't know how _what?
It knows that
</p>
<ol class="org-ol">
<li>Show a =&gt; Show (Aligned a)
</li>
<li>(Show a, Transformable a) =&gt; Show (Voice a)
</li>
</ol>

<p>
So, is there a `Trasformable Pitch` instance? It doesn't seem, from
the module in <a href="https://hackage.haskell.org/package/music-score-1.8/docs/Music-Time-Transform.html">Music.Time.Transform</a>. Why is this? I mean, Pitch is
obviously not a Transformable, but why do they not have a show
instance?  Besides, navigating this imports to see which instances
exist is a bit tiresome if you don't know where these instances are
in advance (in my experience they usually are in some Music.Score
submodule).
</p>

<p>
For now, I'm removing the Show instance.
</p>

<p>
As the duration value of both voices is identical, we need means to
distinguish which of the two is our counterpoint and which is the
cantus.
</p>

<p>
Or we could simply record the voice in the field information, and
provide later to decide if the voice si up or below the
counterpoint. This has the disadvantage of not permitting in a safe.
</p>

<p>
We'll write simply two lenses which let us focus on the upper and
lower voices, as we need. This extension is.
</p>

<p>
So, by design, we have two needs:
</p>
<ol class="org-ol">
<li>The need to distinguish the upper from the lower voice. 
</li>
<li>The need to distinguish the cantus firmus from the counterpoint
exercise.
</li>
</ol>

<p>
As the information about position is completely visible from the
counterpoint, we'll store the information about cantus and
counterpoint in the data itself, leaving position to an appropriate lens.
</p>

<div class="org-src-container">

<pre class="src src-haskell">-- Two parts first species counterpoint
data TPFSC = TPFSC { _cantusFirmus :: CounterpointVoice
                   , _counterpoint :: CounterpointVoice
                   } deriving (Eq, Show)

mkLenses TPFSC'

upperVoice :: Lens' TPFSC CounterpointVoice
upperVoice = lens
             (qui ci va una funzione che selezioni la voce piu' alta)
             (qui ci va una funzione che riscriva,
               se la voce mantiene la sua altezza relativa)
</pre>
</div>

<p>
How do we know which voice is higher? It suffices to check the
first note (as we're not permitting voice overlapping).
After a bit of thougth, I think I have two possibilities:
</p>

<ol class="org-ol">
<li>Using a getter :: this solution is totally correct, but I have
the downside of not being able to change the upper part, if I
want.
</li>
<li>Using a misbehaved lens :: I generally don't like to break laws
in my code, but this could give me the possibility of changing
the last note of the upper part.
</li>
</ol>

<p>
As I find the possibility to change something in the upper part not
so tremendously useful, I'll make a getter.
</p>

<div class="org-src-container">

<pre class="src src-haskell">upperVoice :: TPFSC -&gt; CounterpointVoice
upperVoice c = if c^.cantusFirmus.firstNote &gt;= c^.counterpoint.firstNote
               then c^.cantusFirmus
               else c^.counterpoint
    where
      firstNote :: Lens' CounterpointVoice Pitch
      firstNote = undefined
</pre>
</div>

<p>
Now, the point is, I want to write the lens firstNote, so first
thing would be to read inside the Aligned constructor. In the
documentation of aligned, I don't seem to find a lens doing that.
</p>

<p>
This is a difficulty that I encounter often while toying with the
library: often there is a constructor, which lets me create an
object, and I'm unable to locate easily the corresponding
destructor (or, eventually, the getter).
</p>

<p>
Oh, there is something that converts an <code>Aligned (Voice a)</code> to a
<code>Score a</code>. So, let's see if I can read with a lens inside of a
<code>Score a</code>. It seems that I can read an <code>Event a</code> which exposes an
iso to <code>(Span, a)</code>. So, after that Iso, and _2, I'm getting the
Pitch. Let's verify this intuition in ghci.
</p>

<pre class="example">
ghci&gt; :t cantus ^?! (to renderAlignedVoice . events . traverse . from event . _2)
cantus ^?! (to renderAlignedVoice . events . traverse . from event . _2) :: Pitch

ghci&gt; cantus ^?! (to renderAlignedVoice . events . traverse . from event . _2)
d
</pre>

<p>
However, this process, while possible, should in my opinion be streamlined.
</p>

<p>
So, in the end:
</p>

<div class="org-src-container">

<pre class="src src-haskell">upperVoice :: TPFSC -&gt; CounterpointVoice
upperVoice c = if c^?!cantusFirmus.firstNote &gt;= c^?!counterpoint.firstNote
               then c^.cantusFirmus
               else c^.counterpoint
    where
      firstNote = to renderAlignedVoice . events . traverse . from event . _2

lowerVoice :: TPFSC -&gt; CounterpointVoice
lowerVoice c = if c^?!cantusFirmus.firstNote &gt;= c^?!counterpoint.firstNote
               then c^.counterpoint
               else c^.cantusFirmus
    where
      firstNote = to renderAlignedVoice . events . traverse . from event . _2
</pre>
</div>


<p>
So, let's write a simple realization of the cantus firmus.
</p>

<div class="org-src-container">

<pre class="src src-haskell">example = TPFSC
 { _cantusFirmus = [d, a, g, f, e, d, f, e, d] ^. voice . to (aligned 0 0)
 , _counterpoint = [d', a, g, f, e, d, f, e, d] ^. voice . to (aligned 0 0)
 }
</pre>
</div>

<p>
Now, let's move towards the rendering of this exercise. Now, the
difficulty is the fact that we used the function
<code>renderAlignedVoice</code>, which has type <code>Aligned (Voice Pitch) -&gt;
   Score Pitch</code>. How do we extend this to the two voices?
</p>

<p>
Let's explore the <code>Aligned</code> module. 
</p>

<p>
Ok, can we merge two <code>Score Pitch</code>? Well, it's an istance of
monoid, and I do not see other merge function on first sight, so
let's try:
</p>

<p>
TODO
Ok, that was good.
</p>

<p>
TODO Let's include a smart constructor for counterpoints that let's
us concentrate on the pitch, without worrying about the plumbing.
</p>


<p>
Ok, that was good to have in the same pentagram. Now, I'd like to
be able to split the exercise using two pentagrams.
</p>

<p>
For that, I'm going to check the documentation. In fact this is
well expressed in the docs, if one knows where to search. The point
is the <code>&lt;/&gt;</code> operator. Good, so we now have only to change the
default keys, using the module <code>Music.Score.Meta.Clef</code>.
</p>

<p>
my first try is
</p>

<div class="org-src-container">

<pre class="src src-haskell">renderTPFSCWithClef :: TPFSC -&gt; IO ()
renderTPFSCWithClef es = writeLilypond "composto.ly" $
                               (render . upperVoice $ es) &lt;/&gt; (render . clef CClef . lowerVoice $ es)
</pre>
</div>


<p>
Argh, it doesn't work, and the docs have a TODO marked for an example :P
</p>

<p>
I think this is because <code>CounterpointVoice = Aligned (Voice Pitch)</code>
lacks a <code>HasMeta</code> instance. But <code>Score</code> does have one, so let's try:
</p>

<div class="org-src-container">

<pre class="src src-haskell">renderTPFSCWithClef :: TPFSC -&gt; IO ()
renderTPFSCWithClef es = writeLilypond "composto.ly" $
                               (render . upperVoice $ es) &lt;/&gt; clef CClef (render . lowerVoice $ es)
</pre>
</div>

<p>
Well, this does compile, but the result is unchanged. Why is this?
What should I do to change the lower clef?
</p>

<p>
So, I'll close this installment with a question: how do we
eliminate instruments annotations from the generated pdf?
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Carlo Nucera</p>
<p class="date">Created: 2014-12-21 Sun 14:36</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.4.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
